docs/evidence/dev-worker-request-owner-2026-09-26/raw/mutation-quarantine-observed.patch
--- a/crates/fe2o3-runtime/src/context/worker_admission.rs
+++ b/crates/fe2o3-runtime/src/context/worker_admission.rs
@@ -93,7 +93,6 @@
 
     pub(crate) fn seal_v1(&mut self) {
         self.context.quarantine_after_async_command_panic_v1();
-        self.context.allocation_admission.quarantine_all();
     }
 
     pub(crate) fn enumerate_v1(
