docs/evidence/local-r95-auxiliary-custody-2026-09-11/raw/r95-mutation-v3-parent-poison.patch
--- a/crates/fe2o3-kfd/src/queue_live/construction_auxiliary.rs
+++ b/crates/fe2o3-kfd/src/queue_live/construction_auxiliary.rs
@@ -30,7 +30,6 @@
 
 impl ComputeAqlQueueSessionV1 {
     fn take_for_terminal_auxiliary_construction_v1(&mut self) -> Self {
-        self.poison_terminal();
         let shell = Self {
             engine: None,
             key: self.key,
