docs/evidence/local-r95-auxiliary-custody-2026-09-11/raw/r95-mutation-v3-slot-capacity.patch
--- a/crates/fe2o3-kfd/src/queue_live.rs
+++ b/crates/fe2o3-kfd/src/queue_live.rs
@@ -4167,7 +4167,7 @@
         ));
     }
     if prepared.append {
-        if slots.capacity() <= slots.len() {
+        if false && slots.capacity() <= slots.len() {
             return Err(ComputeAqlQueueSessionErrorV1::Contract(
                 "compute queue lane destination not reserved",
             ));
